subjects = ["Русский язык", "Литература", "Математика", "Физика", "Химия", "Биология", "Информатика", "Иностранный язык", "История", "Обществознание", "География", "Физическая культура", "X"]
subject_counts = {"Русский язык": 4, "Литература": 3, "Математика": 6, "Физика": 3, "Химия": 3, "Биология": 2, "Информатика": 3, "Иностранный язык": 2, "История": 2, "Обществознание": 2, "География": 2, "Физическая культура": 2}
teachers = ["Александр И.Р.", "Екатерина А.П.", "Михаил С.К.", "Ольга В.С.", "Дмитрий А.Ф.", "Анна С.И.", "Андрей П.С.", "Юлия Н.В.", "Владимир В.П.", "Светлана А.К.", "Илья В.М.", "Татьяна Д.Н.", "Георгий Н.М.", "Мария А.К.", "Петр И.С.", "Надежда С.Б.", "Константин В.Л.", "Елена В.К.", "Сергей А.Т.", "Анастасия А.М.", "Игорь В.Н.", "Наталья Д.З.", "Алексей С.К.", "Марина Г.Б.", "Василий И.М.", "Евгения О.П.", "Роман А.Д.", "Людмила А.С.", "Игорь П.В.", "Оксана М.С.", "Алёна В.Л.", "Елена С.Т.", "Ирина В.С.", "Анастасия А.Ф."]

teacher_of_subjects = {}
for subject in subjects:
    teachers_of_subject = []
    for teacher in teachers:
        if teacher not in teachers_of_subject and subject in teacher and subject_counts[subject] > len(teachers_of_subject):
            teachers_of_subject.append(teacher)
    teacher_of_subjects[subject] = teachers_of_subject


print(teacher_of_subjects)
